#ifndef GEN8_RENDER_H
#define GEN8_RENDER_H

#define INTEL_MASK(high, low) (((1 << ((high) - (low) + 1)) - 1) << (low))

#define GEN8_3D(pipeline,op,sub) \
	((3 << 29) | ((pipeline) << 27) | ((op) << 24) | ((sub) << 16))

#define GEN8_STATE_BASE_ADDRESS			GEN8_3D(0, 1, 1)
# define BASE_ADDRESS_MODIFY			(1 << 0)

#define GEN8_STATE_SIP				GEN8_3D(0, 1, 2)

#define GEN8_3DSTATE_VF_STATISTICS		GEN8_3D(1, 0, 0xb)
#define GEN8_PIPELINE_SELECT			GEN8_3D(1, 1, 4)
# define PIPELINE_SELECT_3D		0
# define PIPELINE_SELECT_MEDIA		1

#define GEN8_MEDIA_STATE_POINTERS		GEN8_3D(2, 0, 0)
#define GEN8_MEDIA_OBJECT			GEN8_3D(2, 1, 0)

#define GEN8_3DSTATE_CLEAR_PARAMS               GEN8_3D(3, 0, 0x04)
#define GEN8_3DSTATE_DEPTH_BUFFER               GEN8_3D(3, 0, 0x05)
# define DEPTH_BUFFER_TYPE_SHIFT	29
# define DEPTH_BUFFER_FORMAT_SHIFT	18
/* DW1 */
# define DEPTH_CLEAR_VALID		(1 << 15)
#define GEN8_3DSTATE_STENCIL_BUFFER		GEN8_3D(3, 0, 0x06)
#define GEN8_3DSTATE_HIER_DEPTH_BUFFER		GEN8_3D(3, 0, 0x07)
#define GEN8_3DSTATE_VERTEX_BUFFERS		GEN8_3D(3, 0, 0x08)
# define VB_INDEX_SHIFT			26
# define VB_MODIFY_ENABLE		(1 << 14)
#define GEN8_3DSTATE_VERTEX_ELEMENTS		GEN8_3D(3, 0, 0x09)
# define VE_INDEX_SHIFT		26
# define VE_VALID					(1 << 25)
# define VE_FORMAT_SHIFT				16
# define VE_OFFSET_SHIFT				0
# define VE_COMPONENT_0_SHIFT			28
# define VE_COMPONENT_1_SHIFT			24
# define VE_COMPONENT_2_SHIFT			20
# define VE_COMPONENT_3_SHIFT			16
#define GEN8_3DSTATE_INDEX_BUFFER		GEN8_3D(3, 0, 0x0a)

#define GEN8_DATAPORT_READ_MESSAGE_DWORD_BLOCK_READ          2
#define GEN8_DATAPORT_READ_MESSAGE_DWORD_SCATTERED_READ      3

#define GEN8_DATAPORT_READ_TARGET_DATA_CACHE      0
#define GEN8_DATAPORT_READ_TARGET_RENDER_CACHE    1
#define GEN8_DATAPORT_READ_TARGET_SAMPLER_CACHE   2

#define GEN8_DATAPORT_RENDER_TARGET_WRITE_SIMD16_SINGLE_SOURCE                0
#define GEN8_DATAPORT_RENDER_TARGET_WRITE_SIMD16_SINGLE_SOURCE_REPLICATED     1
#define GEN8_DATAPORT_RENDER_TARGET_WRITE_SIMD8_DUAL_SOURCE_SUBSPAN01         2
#define GEN8_DATAPORT_RENDER_TARGET_WRITE_SIMD8_DUAL_SOURCE_SUBSPAN23         3
#define GEN8_DATAPORT_RENDER_TARGET_WRITE_SIMD8_SINGLE_SOURCE_SUBSPAN01       4

#define GEN8_DATAPORT_WRITE_MESSAGE_OWORD_BLOCK_WRITE                0
#define GEN8_DATAPORT_WRITE_MESSAGE_OWORD_DUAL_BLOCK_WRITE           1
#define GEN8_DATAPORT_WRITE_MESSAGE_DWORD_BLOCK_WRITE                2
#define GEN8_DATAPORT_WRITE_MESSAGE_DWORD_SCATTERED_WRITE            3
#define GEN8_DATAPORT_WRITE_MESSAGE_RENDER_TARGET_WRITE              4
#define GEN8_DATAPORT_WRITE_MESSAGE_STREAMED_VERTEX_BUFFER_WRITE     5
#define GEN8_DATAPORT_WRITE_MESSAGE_FLUSH_RENDER_CACHE               7

#define GEN8_MATH_FUNCTION_INV                              1
#define GEN8_MATH_FUNCTION_LOG                              2
#define GEN8_MATH_FUNCTION_EXP                              3
#define GEN8_MATH_FUNCTION_SQRT                             4
#define GEN8_MATH_FUNCTION_RSQ                              5
#define GEN8_MATH_FUNCTION_SIN                              6 /* was 7 */
#define GEN8_MATH_FUNCTION_COS                              7 /* was 8 */
#define GEN8_MATH_FUNCTION_SINCOS                           8 /* was 6 */
#define GEN8_MATH_FUNCTION_TAN                              9
#define GEN8_MATH_FUNCTION_POW                              10
#define GEN8_MATH_FUNCTION_INT_DIV_QUOTIENT_AND_REMAINDER   11
#define GEN8_MATH_FUNCTION_INT_DIV_QUOTIENT                 12
#define GEN8_MATH_FUNCTION_INT_DIV_REMAINDER                13

#define GEN8_MATH_INTEGER_UNSIGNED     0
#define GEN8_MATH_INTEGER_SIGNED       1

#define GEN8_MATH_PRECISION_FULL        0
#define GEN8_MATH_PRECISION_PARTIAL     1

#define GEN8_MATH_SATURATE_NONE         0
#define GEN8_MATH_SATURATE_SATURATE     1

#define GEN8_MATH_DATA_VECTOR  0
#define GEN8_MATH_DATA_SCALAR  1

#define GEN8_URB_OPCODE_WRITE  0

#define GEN8_URB_SWIZZLE_NONE          0
#define GEN8_URB_SWIZZLE_INTERLEAVE    1
#define GEN8_URB_SWIZZLE_TRANSPOSE     2

#define GEN8_SCRATCH_SPACE_SIZE_1K     0
#define GEN8_SCRATCH_SPACE_SIZE_2K     1
#define GEN8_SCRATCH_SPACE_SIZE_4K     2
#define GEN8_SCRATCH_SPACE_SIZE_8K     3
#define GEN8_SCRATCH_SPACE_SIZE_16K    4
#define GEN8_SCRATCH_SPACE_SIZE_32K    5
#define GEN8_SCRATCH_SPACE_SIZE_64K    6
#define GEN8_SCRATCH_SPACE_SIZE_128K   7
#define GEN8_SCRATCH_SPACE_SIZE_256K   8
#define GEN8_SCRATCH_SPACE_SIZE_512K   9
#define GEN8_SCRATCH_SPACE_SIZE_1M     10
#define GEN8_SCRATCH_SPACE_SIZE_2M     11

struct gen8_blend_state {
	struct {
		/* 00 */ uint32_t pad:19;
		/* 19 */ uint32_t y_dither_offset:2;
		/* 21 */ uint32_t x_dither_offset:2;
		/* 23 */ uint32_t color_dither_enable:1;
		/* 24 */ uint32_t alpha_test_function:3;
		/* 27 */ uint32_t alpha_test:1;
		/* 28 */ uint32_t alpha_to_coverage_dither:1;
		/* 29 */ uint32_t alpha_to_one:1;
		/* 30 */ uint32_t ia_blend:1;
		/* 31 */ uint32_t alpha_to_coverage:1;
	} common;

	struct {
		/* 00 */ uint32_t write_disable_blue:1;
		/* 01 */ uint32_t write_disable_green:1;
		/* 02 */ uint32_t write_disable_red:1;
		/* 03 */ uint32_t write_disable_alpha:1;
		/* 04 */ uint32_t pad0:1;
		/* 05 */ uint32_t alpha_blend_function:3;
		/* 08 */ uint32_t dest_alpha_blend_factor:5;
		/* 13 */ uint32_t source_alpha_blend_factor:5;
		/* 18 */ uint32_t color_blend_function:3;
		/* 21 */ uint32_t dest_blend_factor:5;
		/* 26 */ uint32_t source_blend_factor:5;
		/* 31 */ uint32_t color_blend:1;
		/* 32 */ uint32_t post_blend_clamp:1;
		/* 33 */ uint32_t pre_blend_clamp:1;
		/* 34 */ uint32_t color_clamp_range:2;
		/* 36 */ uint32_t pre_blend_source_only_clamp:1;
		/* 37 */ uint32_t pad1:22;
		/* 59 */ uint32_t logic_op_function:4;
		/* 63 */ uint32_t logic_op:1;
	} rt;
};

struct gen8_color_calc_state {
	struct {
		/* 00 */ uint32_t alpha_test_format:1;
		/* 01 */ uint32_t pad0:14;
		/* 15 */ uint32_t round_disable:1;
		/* 16 */ uint32_t bf_stencil_ref:8;
		/* 24 */ uint32_t stencil_ref:8;
	} cc0;

	union {
		float alpha_ref_f;
		struct {
			uint32_t ui:8;
			uint32_t pad0:24;
		} alpha_ref_fi;
	} cc1;

	float constant_r;
	float constant_g;
	float constant_b;
	float constant_a;
};

struct gen8_sampler_state {
	struct {
		/* 00 */ unsigned int aniso_algorithm:1;
		/* 01 */ unsigned int lod_bias:13;
		/* 14 */ unsigned int min_filter:3;
		/* 17 */ unsigned int mag_filter:3;
		/* 20 */ unsigned int mip_filter:2;
		/* 22 */ unsigned int base_level:5;
		/* 27 */ unsigned int lod_preclamp:2;
		/* 29 */ unsigned int default_color_mode:1;
		/* 30 */ unsigned int flexible_filter_clamp:1;
		/* 31 */ unsigned int disable:1;
	} ss0;

	struct {
		/* 00 */ unsigned int cube_control_mode:1;
		/* 01 */ unsigned int shadow_function:3;
		/* 04 */ unsigned int chroma_key_mode:1;
		/* 05 */ unsigned int chroma_key_index:2;
		/* 07 */ unsigned int chroma_key_enable:1;
		/* 08 */ unsigned int max_lod:12;
		/* 20 */ unsigned int min_lod:12;
	} ss1;

	struct {
		unsigned int pad:6;
		unsigned int default_color_pointer:26;
	} ss2;

	struct {
		/* 00 */ unsigned int r_wrap_mode:3;
		/* 03 */ unsigned int t_wrap_mode:3;
		/* 06 */ unsigned int s_wrap_mode:3;
		/* 09 */ unsigned int pad:1;
		/* 10 */ unsigned int non_normalized_coord:1;
		/* 11 */ unsigned int trilinear_quality:2;
		/* 13 */ unsigned int address_round:6;
		/* 19 */ unsigned int max_aniso:3;
		/* 22 */ unsigned int pad0:2;
		/* 24 */ unsigned int non_separable_filter:8;
	} ss3;
};

/* Surface state DW0 */
#define SURFACE_RC_READ_WRITE	(1 << 8)
#define SURFACE_TILED		(1 << 13)
#define SURFACE_TILED_Y		(1 << 12)
#define SURFACE_FORMAT_SHIFT	18
#define SURFACE_VALIGN_1	(0 << 16) /* reserved! */
#define SURFACE_VALIGN_4	(1 << 16)
#define SURFACE_VALIGN_8	(2 << 16)
#define SURFACE_VALIGN_16	(3 << 16)
#define SURFACE_HALIGN_1	(0 << 14) /* reserved! */
#define SURFACE_HALIGN_4	(1 << 14)
#define SURFACE_HALIGN_8	(2 << 14)
#define SURFACE_HALIGN_16	(3 << 14)
#define SURFACE_TYPE_SHIFT		29

/* Surface state DW2 */
#define SURFACE_HEIGHT_SHIFT        16
#define SURFACE_WIDTH_SHIFT         0

/* Surface state DW3 */
#define SURFACE_DEPTH_SHIFT         21
#define SURFACE_PITCH_SHIFT         0

#define SWIZZLE_ZERO		0
#define SWIZZLE_ONE		1
#define SWIZZLE_RED		4
#define SWIZZLE_GREEN		5
#define SWIZZLE_BLUE		6
#define SWIZZLE_ALPHA		7
#define __SURFACE_SWIZZLE(r,g,b,a) \
